{"pages":[{"title":"404","text":"","link":"/404.html"},{"title":"BBS","text":"","link":"/bbs/index.html"}],"posts":[{"title":"在开始一个成功的机器学习项目之前要问的11个问题","text":"机器学习算法正在改变几乎每个产业。他们正提高生产力，促进销售并帮我们做出更明智的决定。很多组织也早已在利用机器学习的功能，或者放在其规划中作为一个值得追求的机会。 问题是ML很复杂，当开始一个ML项目的时候你很可能会问自己需要考虑什么。在你启动一个ML计划前，你应该花一些时间来计划。这将有助于最大程度减少潜在风险并最大化积极成果。 这十一个问题会考虑到你的策略，文化，资源和数据。这些问题将帮助你为ML项目构建战略路线图，并使实施更进一步。 STRATEGY1. 你组织的业务目标是什么？即使将ML作为实验开始，也应该始终有一个最终的业务目标，该目标实际上很重要，并且可能会受到ML的影响。机器学习项目的成功标准应该不是一定的准确度，而是业务指标。 例如，假设您正在零售领域，现在的主要重点是降低成本。一个特定的业务目标可能是在下半年末将仓库成本降低10％。实现此目标的一种方法可能是通过从ML算法获得的优化。 2. ML是应该降低成本还是增加收入？成功的机器学习项目可以降低成本或增加收入（或两者都有），您应该定义目标是什么。只有这样，ML才能对您的组织及其成长产生重大影响。 借助机器学习降低成本的示例包括虚拟助手和聊天机器人，预测性维护和库存优化。相反，实施了诸如价格优化，通过视频分析或推荐系统进行行为客户跟踪之类的解决方案来增加收入。 3. 衡量ML计划成功的清晰而现实的方法是什么?每个ML项目都是不同的，您需要定义一个成功指标，该指标对您的特定项目有意义，并且可以衡量。设置该指标后，您应该确保它被业务人员和数据科学家所接受。 机器学习计划的成功指标可能是工作时间，客户查询响应时间或准确性百分比。 4. 你的组织如何处理风险？与所有创新一样，由于多种因素，机器学习计划的结果可能不会如预期的那样出现。也许您发现需要10倍的数据才能做有意义的事情，或者数据根本不够好。这就是为什么您应该考虑ML计划失败的风险，并能够在项目未达到您的期望的情况下转到另一个项目。 CULTURE/RESOURCES5. 如何获得合适的人才？由于对ML的专业需求很高，因此在市场上很难获得。当您无法找到合适的人（或没有足够的人）来从事该项目时，完全或部分外包ML项目是一个不错的选择，尤其是在时机很重要且您希望早日实施解决方案时。 6. 你有没有对ML是什么有更清晰的理解？了解不同的用例，需要什么输入ML算法以及什么时候不能应用它们，可以帮助您在项目中做出正确的决定。您应该从概念上理解ML给图片带来的好处，例如，通过阅读机器学习博客和案例研究，参加会议或与专家交谈。 7. 是否保证信息的获取？当启动ML计划时，数据科学家需要轻松访问信息。他们将需要与关键人员（可能来自不同部门，例如IT部门）合作。那些人需要用某种商业知识来支持该项目，而内部官僚主义将是主要的制约因素。理想情况下，机器学习和数据科学应及时遍及整个组织。 “数据科学是新的统计方法”。 8. 是否将该项目计划成中期项目？机器学习计划的结果需要时间，您将无法在一夜之间证明自己的成功。这需要你的组织都把机器学习的主动性作为中期项目。在软件开发世界中，时间估计一直是一个挑战。在机器学习开发的情况下，这一挑战更加艰巨，因为流程本身具有更多的不确定性。有时，您可能会停滞不前，简单的突破就可以彻底扭转局面。也就是说，您应该注意，可能需要花费几个月的时间才能获得理想的结果。 DATA9. 你的组织收集了正确的数据吗？机器学习算法不是魔法。他们需要数据才能工作，并且只能与您输入的数据一样好。根据您的目标，有不同的方法和资源来收集正确的数据。无论如何，您拥有的输入数据越多，机器学习模型表现良好的机会就越大。如果您对数据的数量和质量有疑问，可以请数据科学家帮助您评估数据集，并在必要时找到获取第三方数据的最佳方法。 10. 你的组织是否以正确的格式收集数据？除了拥有正确数量和类型的数据外，您还应确保以正确的格式收集数据。想象一下，您已经为智能手机拍摄了数千张完美的照片（高分辨率和白色背景），以训练计算机视觉模型来检测图像中的智能手机。然后，您发现它不起作用，因为实际用例是检测到在各种照明/对比度/背景下拿着智能手机的人，而不是自己。您过去的数据收集工作几乎毫无价值，您需要重新开始。另外，您应该了解所收集的数据中是否存在偏差，因为ML算法将学习该偏差。 11. 是否考虑过人工标注数据？根据项目，机器学习解决方案可以基于监督算法。这些算法要求对收集的数据进行标记，即。人们需要为我们收集的每个示例指定预期的结果，以便算法可以从这些见解中学习。确保在项目预算中包括构建此类数据集的人员成本。","link":"/2019/11/01/开始一个机器学习项目需要知道的/"},{"title":"厦门","text":"个人觉得厦门没什么好玩的，被炒起来的网红城市。厦门的慢体现在生活中吧，如果去玩还是会差些。最毒的就是每天晚上都要去曾厝垵吃东西（芒果），吃到撑。","link":"/2019/10/12/厦门/"},{"title":"图像识别工程步骤","text":"数据准备 拍摄照片或下载数据集 图像标注 图像数据处理（图像合成、图像裁剪、图像改变大小） 检查标注文件的正确性 划分训练集、验证集 搭建神经网络 模型训练（读取数据的多线程生成器、多GPU并行训练、保存模型） 模型评估（加载模型、使用业务对应的评估指标在验证集上计算模型效果） 模型测试（使用实际场景中的图像数据测试模型效果，单张图片检查、实时视频检测） 模型部署（开发web服务端接口、前端界面） 闭环优化 根据业务使用场景在第2步优化 根据模型在实际场景的使用效果在3-6步间循环迭代。如果新加入的数据提高了模型在验证集上的效果，则替换模型部署使用的权重文件。 如果替换后的新权重文件在实际场景中的使用效果不好，则使用版本控制工具回退到上一个版本的权重文件。","link":"/2019/09/30/图像识别工程大概步骤/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/08/30/hello-world/"},{"title":"hello","text":"aa今天是0831","link":"/2019/08/28/hello/"},{"title":"My New Post","text":"这是第二个博客 2019年8月29","link":"/2019/08/28/My-New-Post/"},{"title":"A SImple Post'","text":"Here is simaple markdown","link":"/2019/08/28/Post/"},{"title":"test_my_site","text":"","link":"/2019/08/28/test-my-site/"}],"tags":[{"name":"Travel","slug":"Travel","link":"/tags/Travel/"},{"name":"Machine Learning","slug":"Machine-Learning","link":"/tags/Machine-Learning/"}],"categories":[]}